Autodesk.Revit.DB.CustomFieldNecessaryData.GetNecessarySpecTypeIds
Gets the specs that describes the data type that are needed to compute the value/graphics of this custom field.
Returns:
Returns the specs that describes the data type that are needed to compute the value/graphics of this custom field.

Autodesk.Revit.DB.CustomFieldNecessaryData.SetNecessarySpecTypeIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ForgeTypeId})
Sets the specs that describe the data type that are needed to compute the value/graphics of this custom field.
necessarySpecTypeIds:
The necessary specs describing the data type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ids that were set should represent spec types.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CustomFieldNecessaryData.GetNecessaryCategoryIds
Gets the ids of the categories/subcategories that are needed to compute the value/graphics of this custom field.
Returns:
Returns the ids of the categories/subcategories that are needed to compute the value/graphics of this custom field.

Autodesk.Revit.DB.CustomFieldNecessaryData.SetNecessaryCategoryIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets the ids of the categories/subcategories that are needed to compute the value/graphics of this custom field.
necessaryCategoryIds:
The necessary categories/subcategories ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ids that were set should represent categories or subcategories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CustomFieldNecessaryData.GetNecessaryElementTypeIds
Gets the ids of the element types that are needed to compute the value/graphics of this custom field.
Returns:
Returns the ids of the elements that are needed to compute the value/graphics of this custom field.

Autodesk.Revit.DB.CustomFieldNecessaryData.SetNecessaryElementTypeIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets the ids of the element types that are needed to compute the value/graphics of this custom field.
necessaryElementTypeIds:
The necessary element type ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ids that were set should represent Element Types.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CustomFieldNecessaryData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CustomFieldNecessaryData.#ctor
Constructs a new instance of a CustomFieldNecessaryData.

Autodesk.Revit.DB.CustomFieldNecessaryData
Class where the ids of the element types or categories/subcategories or specs describing the data type
that are needed to compute the value/graphics of this field can be set.
Examples of such ids can be ids of dimension styles or ids of categories/subcategories whose graphic styles are used.